Revit 2027 API
TrussMemberInfo Properties
The TrussMemberInfo type exposes the following members.
Properties
Name | Description
hostTrussId | The host truss' ElementId of the member.
lockedToTruss | Whether the member is locked to the host truss.
memberTypeKey | Kind of the member in the truss.
Top
See Also
Reference
TrussMemberInfo Class
Autodesk.Revit.DB.Structure Namespace